Ran Apply for project: `github` dir: `apps/github` workspace: `github`

<details><summary>Show Output</summary>

```diff
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/elxilote/github/runs/run-5qNRp5EjkmDenMsu

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
github_actions_secret.telegram_chat: Refreshing state... [id=ansible_playbooks:TELEGRAM_TOKEN]
github_actions_secret.telegram_to: Refreshing state... [id=ansible_playbooks:TELEGRAM_TO]
github_repository.repo["dotfiles-nix"]: Refreshing state... [id=dotfiles-nix]
github_repository.repo["obs-wiki"]: Refreshing state... [id=obs-wiki]
github_repository.repo["pulumi"]: Refreshing state... [id=pulumi]
github_repository.repo["chef"]: Refreshing state... [id=chef]
github_repository.repo["k8s-apps"]: Refreshing state... [id=k8s-apps]
github_repository.repo["meal-notifier"]: Refreshing state... [id=meal-notifier]
github_repository.repo["twitch-bot"]: Refreshing state... [id=twitch-bot]
github_repository.repo["ansible_playbooks"]: Refreshing state... [id=ansible_playbooks]
github_repository.repo["api-go-templ"]: Refreshing state... [id=api-go-templ]
github_repository.repo["deckmaster-config"]: Refreshing state... [id=deckmaster-config]
github_repository.repo["obs-go-cli"]: Refreshing state... [id=obs-go-cli]
github_repository.repo["dotfiles"]: Refreshing state... [id=dotfiles]
github_actions_secret.dockerhub_username: Refreshing state... [id=twitch-bot:DOCKERHUB_USERNAME]
data.github_actions_public_key.twitch-bot: Refreshing...
data.github_actions_public_key.ansible_playbooks: Refreshing...
github_actions_secret.dockerhub_token: Refreshing state... [id=twitch-bot:DOCKERHUB_TOKEN]
data.github_actions_public_key.twitch-bot: Refresh complete after 2s [id=3380204578043523366]
data.github_actions_public_key.ansible_playbooks: Refresh complete after 2s [id=3380204578043523366]
github_repository.repo["obs-wiki"]: Drift detected (update)
github_repository.repo["k8s-apps"]: Drift detected (update)
github_repository.repo["obs-go-cli"]: Drift detected (update)
github_repository.repo["deckmaster-config"]: Drift detected (update)
github_repository.repo["dotfiles-nix"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.dockerhub_token will be destroyed
  - resource "github_actions_secret" "dockerhub_token" {
      - created_at      = "2024-01-16 05:59:26 +0000 UTC" -> null
      - encrypted_value = (sensitive value) -> null
      - id              = "twitch-bot:DOCKERHUB_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "twitch-bot" -> null
      - secret_name     = "DOCKERHUB_TOKEN" -> null
      - updated_at      = "2024-01-16 05:59:26 +0000 UTC" -> null
    }

  # github_actions_secret.dockerhub_token["meal-notifier"] will be created
  + resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_token["twitch-bot"] will be created
  + resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username will be destroyed
  - resource "github_actions_secret" "dockerhub_username" {
      - created_at      = "2024-01-16 05:59:28 +0000 UTC" -> null
      - encrypted_value = (sensitive value) -> null
      - id              = "twitch-bot:DOCKERHUB_USERNAME" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "twitch-bot" -> null
      - secret_name     = "DOCKERHUB_USERNAME" -> null
      - updated_at      = "2024-01-16 05:59:28 +0000 UTC" -> null
    }

  # github_actions_secret.dockerhub_username["meal-notifier"] will be created
  + resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username["twitch-bot"] will be created
  + resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.

github_actions_secret.dockerhub_username: Destroying... [id=twitch-bot:DOCKERHUB_USERNAME]
github_actions_secret.dockerhub_token: Destroying... [id=twitch-bot:DOCKERHUB_TOKEN]
github_actions_secret.dockerhub_username["meal-notifier"]: Creating...
github_actions_secret.dockerhub_token["meal-notifier"]: Creating...
github_actions_secret.dockerhub_username["twitch-bot"]: Creating...
github_actions_secret.dockerhub_token["twitch-bot"]: Creating...
github_actions_secret.dockerhub_username: Destruction complete after 0s
github_actions_secret.dockerhub_token: Destruction complete after 1s
github_actions_secret.dockerhub_token["meal-notifier"]: Creation complete after 7s [id=meal-notifier:DOCKERHUB_TOKEN]
github_actions_secret.dockerhub_username["meal-notifier"]: Creation complete after 8s [id=meal-notifier:DOCKERHUB_USERNAME]
github_actions_secret.dockerhub_username["twitch-bot"]: Creation complete after 8s [id=twitch-bot:DOCKERHUB_USERNAME]
github_actions_secret.dockerhub_token["twitch-bot"]: Creation complete after 8s [id=twitch-bot:DOCKERHUB_TOKEN]

Apply complete! Resources: 4 added, 0 changed, 2 destroyed.
```

</details>